app/controllers/events_controller.rb

  def create
    @event = Event.new(title: event_params[:title],
                       description: event_params[:description],
                       start_date: make_start_date(event_params),
                       end_date: make_end_date(event_params))

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @event.update(title: event_params[:title],
                      description: event_params[:description],
                      start_date: make_start_date(event_params),
                      end_date: make_end_date(event_params))
---
UPDATE "events" SET "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_date", "2019-05-07 18:00:00"], ["end_date", "2019-05-07 19:00:00"], ["updated_at", "2019-05-06 16:06:10.389904"], ["id", 13]]